# OSI 7계층
네트워크 통신이 일어나는 과정을 7단계로 나눈 것입니다.
왜 나누었을까? 네트워크 상 특정한 곳에 이상이 생기면 해당 단계만을 고쳐도 되기 때문에 유지보수가 간편해지고, 흐름을 보기 쉬워진다.

1. 물리계층 : 전기 신호 전달
	- 통신 케이블로 데이터를 전송하게 된다. 전기적으로 On, Off 상태인 1과 0(비트)로 통신이 나타내어진다.
	- 단지 데이터를 **전달**만 할 뿐, 전송하려는 데이터가 무엇인지는 당연히 신경쓰지 않는다. 전기적인 신호를 보내고, 받는 기능만을 한다. 전기신호를 전달만 해주는 물리적인 연결선을 생각하면 된다.
	- 케이블, 리피터, 허브
2. 데이터링크계층 : MAC 주소로 통신
	- 물리계층을 통해 송수신되는 정보의 오류와 흐름을 관리하여, 안전한 정보 전달을 수행할 수 있도록 도와준다.
	- 단위는 프레임frame인데, 비트로 이루어진 데이터를 네트워크 전송방식에 맞게 단위화(Framing)해서 그 단위를 전송해주기 때문이다. 물리계층과 달리 데이터링크계층부터는 전기신호를 전달만해주는 게 아니라,
		1. 오류감지 : 전달에 있어 충돌이 일어나지 않도록 방지(이더넷의 CSMA/CD 프로토콜)해주고, 
		2. 주소 할당 : 신호 도착지(destination)의 MAC 주소를 MAC 주소 테이블에 저장하고, 전달받은 프레임의 옥탯 값에 따라 어떤 장치로 보낼지를 결정해준다.
	- 이더넷Ethernet 프로토콜(CSMA/CD)이 있고, 이더넷 장치를 위한 표준 주소 지정 시스템인 MAC 주소 시스템을 제공하여 MAC 주소로 통신할 수 있다.
	- 이더넷 주소(=MAC 주소)란? 컴퓨터 네트워크 기술 중의 하나로, 네트워크에 연결된 각 기기들이 갖는 고유의 주소값이다. 48비트의 길이로 이루어져 있다. 
	- L2 스위치 : 전송받은 프레임을 어디로 보내야할 지 결정해주는 하드웨어 장치. MAC 주소 테이블을 활용하는데, 만약 전송해야 하는 도착지 주소가 없는 경우엔 모든 포트에 그 프레임을 전송한 후, 도착지의 장치가 다시 MAC 주소를 테이블로 응답해주면 그 주소값을 MAC 주소 테이블에 저장한다. 다음부턴 테이블을 참고해서 프레임을 전송하게 된다.
3. 네트워크계층 : 주소를 부여해주고, 경로를 설정(라우팅)해준다. 즉 어떤 서버로 연결하기 위한 최적의 경로(=빠르고 안전한 경로)를 찾아준다.
	- 송수신 호스트 사이의 패킷 전달 경로를 선택한다. 이러한 라우팅을 위해서, 네트워크 구성 형태에 관한 정보를 관리하는 라우팅 테이블을 갖는다.
	- 전송 경로 결정시의 원칙
		1. 공평 원칙 : 다른 패킷의 우선 처리를 위해 다른 패킷이 손해보면 안된다.
		2. 효율 원칙 : 패킷의 평균 지연 시간이나, 중간에 거쳐가는 라우터의 수 등등 전체 네트워크의 효율성을 고려한다.
	- 라우팅의 종류
		1. 정적 라우팅 : 패킷 전송이 이루어지기 전에 경로 정보를 미리 저장하여 중개한다. 최적의 라우팅 정보를 개별 라우터에 저장하여 관라해야 한다. 단, 경로 정보 갱신이 어려워 네트워크 변화와 혼잡에 대처하기 힘들다.
		2. 동적 라우팅 : 라우팅 경로 정보를 네트워크 상황에 따라 적절하게 변경한다. 경로 정보 변경 주기에 따라 보완이 가능하지만, 이로 인해 복잡한 작업이 추가되고, 경로 정보 수집과 관리로 인한 성능 저하가 발생할 수 있다.
	- 사용하는 패킷
		1. HELLO 패킷 : 주변 라우터에 해당 패킷을 보내어 주변 경로 정보를 파악한다. 라우터 초기화 과정에서 이웃한 라우터를 초기화하기 위하여 사용된다.
		2. ECHO 패킷 : 라우터 사이의 전송 지연 시간을 측정한다. 해당 패킷을 수신한 호스트는 송신 호스트에 즉각 회신하므로, 전송 지연 시간을 유추할 수 있다.
	- 연결형 서비스와 비연결형 서비스를 제공한다.
		- 연결형 서비스 : 데이트 전송 전에 데이터의 전송 경로를 미리 결정한다. -> 패킷이 순서대로 전송되는 것을 보장하며, 패킷 추적 및 관리를 해주어 신뢰성 있는 네트워크를 구성할 수 있다.
		- 비연결형 서비스 : 전송 경로를 사전에 결정하지 않고, 패킷 단위로 결정한다. -> 패킷들이 서로 다른 경로로 전송되어 도착 순서가 일정하지 않으므로, 상위 계층에서 순서를 재조정하고 분실된 패킷을 복구하는 기능을 한다. 빠른 대신 신뢰성은 떨어지므로, 스트리밍 서비스처럼 **연속성**이 중요한 상황에 사용한다.
	- 라우팅 테이블 : 목적지 호스트와 다음 홉(목적지 호스트까지 패킷을 전달하기 위한 인접 경로)을 갖는다.
4. 전송계층 : 통신을 활성화하는 계층이다. 양 끝단의 사용자들이 신뢰성 있는 데이터를 주고 받을 수 있도록 보장한다.
	- 각각의 패킷을 하나의 데이터로 합쳐서 상위 계층으로 전달해준다. 이때, 신뢰성 있는 데이터를 주고 받았음을 보장하기 위하여 **패킷들의 전송이 유효한지 확인**하고, **전송이 실패한 패킷들을 다시 전송**한다.
5. 세션 계층 : 통신을 위한 논리적 연결
	- 애플리케이션간에 **세션**을 구축하고 관리하며 종료시키는 역할을 한다. 전송모드(반이중, 전이중, 단방향 등)를 결정하고, 대화와 동기를 위한 데이터 교환을 관리한다.
6. 표현 계층 : 데이터 표현이 상이한 응용 프로세스의 독립성을 제공하고, 암호화한다.
	- 코드 간의 번역을 담당하며, 사용자 시스템에서 데이터의 형식상 차이를 다루는 부담을 응용 꼐층으로부터 덜어준다. 인코딩, 암호화를 해준다. 가령 텍스트인지, 그림인지, GIF인지, JPG인지의 구분 등을 표현 계층에서 담당하고 있다.
7. 응용 계층 : 네트워크 소프트웨어 UI 부분, 사용자 입출력 부분 
	- 최종 목적지로서, 응용 프로세스와 직접 관계하여 일반적인 응용 서비스를 수행한다. 가상 터미널인 텔넷, HTTP, FTP, SMTP 등과 같은 프로토콜이 있다.
	- HTTP 프로토콜 : 응용계층의 프로토콜. 동작형태가 클라이언트-서버 모데롤 동작한다. 클라이언트와 서버 간에 **HTTP 메세지**를 주고받으며 통신한다.
	
